{
  "Das Web": [
    "Was ist «das Web»?", 
    "Was meint der Begriff «Netz Neutralität»?", 
    "Was versteht man unter dem Konzept «Big is Beautiful» im Kontext des Webs.", 
    "Was versteht man unter dem Prinzip «Bottom Up» im Kontext des Webs.", 
    "Was ist der «AAA Slogan»?", 
    "Inwiefern wirkt der Grundsatz der «Offenheit» im Web."
  ],
  "Grundlegende Begriffe des Web": [
  "Was charakterisiert eine Ressource im Web und was unterscheidet eine Ressource von deren Repräsentation?", 
  "Was ist eine URI?", 
  "Was unterscheidet eine URL von einer URN?", 
  "Was versteht man unter einem RFC und wofür wird ein RFC im Kontext des Webs eingesetzt?", 
  "Was meint «eine Ressource muss nicht immer den gleichen Inhalt haben, aber eine Ressource bezeichnet inhaltlich immer das gleiche»?", 
  "Wie ist eine URL aufgebaut?", 
  "Was könnte die Repräsentation einer Ressource sein?", 
  "Was unterscheidet die Repräsentation einer Ressource von der Präsentation derselben?", 
  "Was versteht man unter HTTP?", 
  "Skizzieren Sie einen kompletten HTTP Request-Response Cycle.", 
  "Was versteht man unter dem Begriff «Hypertext» und welche Idee steckt hinter dem Konzept?", 
  "Was unterscheidet ein Protokoll von einem Dienst und wie sind beide zu charakterisieren?", 
  "Welche Mechanik steckt hinter mehrerer Repräsentation einer Ressource?"
  ],
  "Grundlegende Begriffe verteilter Systeme": [
  "Was unterscheidet eine Softwarekomponente von einem Dienst?", 
  "Was versteht man unter einem «verteilen System»?", 
  "Wozu dient ein Kontrakt bei verteilten Systemen?", 
  "Welcher Mechanismus steckt hinter dem Publish-Subscribe Paradigma?", 
  "Wodurch ist das Paradigma der Synchronität gekennzeichnet?"
  ],
  "Webservices": [
  "Was unterscheidet einen Internetdienst von einem Webservice?", 
  "Was wird mit dem Begriff «Endpunkt» bezeichnet?", 
  "Was versteht man unter einem «Microservice» und welche Vor- und Nachteile bringt dieses Konzept mit sich?", 
  "Was sollte bei der Nutzung von Drittanbieterdiensten berücksichtigt werden?", 
  "Was ist der Unterschied zwischen der Anwendungs- und der Präsentationslogik? Warum ist des sinnvoll diese voneinander zu trennen?", 
  "Was versteht man unter dem Akronym «API»?"
  ],
  "(Daten-)/modellierung":[
  
  "Warum ist es bei der Entwicklung komplexerer Anwendungen wichtig, zunächst ein Domänenmodell zu entwickeln?", 
  "Erklären Sie die Unterschiede geläufiger «Standards für Zeichensätze» im Web.", 
  "Erklären Sie das Konzept von «Auszeichnungssprachen» (Markup Languages).", 
  "Was versteht man unter «Marshalling»?", 
  "Erklären Sie die Rolle und Bedeutung von «Schemasprachen» für den Datenaustausch im Web.", 
  "Erklären Sie den Unterschied zwischen «Wohlgeformtheit» und «Gültigkeit» von XML Dokumenten.", 
  "Was ist ein «Element» in einem XML Dokument.", 
  "Erklären Sie das Konzept der «Namespaces».", 
  "Was versteht man unter dem Begriff/ Konzept «Ubiquitous Language» im Kontext von *Domain-Driven Design*?", 
  "Was ist ein Domänenmodell? Was sind Assoziationen darin?", 
  "Was ist ein «Bounded Context» in einem Domänenmodell?", 
  "Was meint «lose Kopplung» und was ist der Vorteil dieser Idee?", 
  "Was sind Merkmale einer losen Kupplung?", 
  "Warum wird die lose Kopplung von Softwarekomponenten propagiert und was sind Elemente der losen Kopplung?", 
  "Warum ist es wichtig bei der  Modellierung mit einem Domänenmodell zu beginnen?"
  ],
  
  "REST": [
  "Was verbirgt sich hinter dem Akronym «REST»?", 
  "Was sind die REST Prinzipien?", 
  "Erklären Sie in drei Sätzen die Grundidee von REST.", 
  "Was unterscheidet eine Architekturstil von einem Standard?", 
  "Charakterisieren Sie die Beziehung zwischen einer Ressource und ihren Repräsentationen.", 
  "Was versteht man unter Idempotenz von HTTP Verben?", 
  "Unter welchen Bedingungen wird ein HTTP Verb als sicher bezeichnet?", 
  "Was ist mit dem Begriff „Web as a application platform“ gemeint?", 
  "Erklären Sie die wesentlichen REST Prinzipien.", 
  "Erklären Sie «Richardson’s maturity model».", 
  "Warum ist es wichtig dass Anwendungen die beabsichtigte Semantik von http Verben befolgen?", 
  "Was versteht man unter «URI tunneling»?", 
  "Warum klassifiziert man «POX applications» als «level 0» und «URI-Tunneling applications» als «level 1»?", 
  "Wie kann das Konzept der «http status codes» adäquat in REST Anwendungen eingesetzt werden?", 
  "Was spricht für und gegen die Verwendung von selbstdefinierten Verben bei der Konzeption eines REST Service?", 
  "Welche Information sollte das «location»-Feld des http headers in der Antwort auf einen POST Request beinhalten?", 
  "Erklären Sie den Unterschied zwischen der Nutzung von http als «transport  protocol» und der Nutzung als «application protocol».", 
  "Wenn man die Beschreibung eines Web Service als «contract» betrachtet:  welche Informationen müssen dann in einem Überblick über den contract eines RESTful Web Service enthalten sein?", 
  "Nennen Sie Konventionen, die helfen zu entscheiden, ob zur Übermittlung von Daten vom Client an den Server PUT oder POST verwendet werden soll.", 
  "Unter welchen Bedingungen bezeichnet man ein http Verb als «idempotent», unter welchen als «safe»?", 
  "Zu welchem Zweck werden «Entity Tags» (ETags) in RESTful Architekturen verwendet?", 
  "Stellen Sie ein Beispiel detailliert dar, bei dem es zu Konflikten bei der Veränderung des Zustandes von Ressourcen kommen kann! Das Beispiel kann  gerne auch aus Ihrer Workshop Anwendung abgeleitet sein.", 
  "Welche Werte kann das rel-Attribut von Links in REST Anwendungen annehmen?", 
  "Erklären Sie inwiefern die Verwendung von Hypermedia in REST Architekturen zur losen Kopplung von Dienstanbieter und Dienstnutzer beiträgt!", 
  "Erklären Sie warum für Hypermediaformate in XML als content type nicht application/XML angegeben werden sollte.", 
  "Was versteht man unter Primär-, Listen- und Subressourcen?"
  ],
  "Asynchrone Kommunikation": [
  "Erklären Sie Sinn und Funktionsweise von AJAX. Gehen Sie auch darauf ein, welche Vorgänge asynchron sind.", 
  "Erklären Sie die Möglichkeiten auf der Basis von http asynchrone Kommunikation umzusetzen.", 
  "Erklären Sie die Unterschiede zwischen «Fat Ping» und «Light Ping».", 
  "Was versteht man unter einen Queuing System?", 
  "Was sind die Vorteile von «zeitlich entkoppelter» und «referenziell entkoppelter» Kommunikation?", 
  "Erklären Sie die Grundidee von Publish/subscribe?", 
  "Was sind die Besonderheiten von Push Diensten auf mobilen Endgeräten.", 
  "Erklären Sie die grundsätzlichen Abläufe bei der Einrichtung und Nutzung einer  auf «Firebase Cloud Messaging» basierenden Kommunikation.", 
  "Erklären Sie die Architektur eines auf XMPP basierenden Systems.", 
  "Erklären Sie, wie XML zur Kommunikation in XMPP genutzt wird.", 
  "Was versteht man unter den «stanza» element Namen «message», «presence», und «iq»?", 
  "Wie kann eine «Multi-Party-Kommunikation» mit XMPP verwirklicht werden?", 
  "Wie wird eine Publish/Subscribe Kommunikation in XMPP verwirklicht?", 
  "Grenzen Sie Publish/Subribe- und Client-Server voneinander ab.", 
  "Wie kommt man von einem Domänenmodell zu REST?", 
  "Wie funktioniert asynchrone Kommunikation bei HTTP?"
  ]}